import csv

import pandas as pd

df = pd.read_csv("csv_file/RECIPE_ING_NAME_LIST2.csv", encoding="cp949")
df.dropna(inplace=True)

ingri = ["감자", "달걀", "계란", "흰자", "유정란", "달갈", "노른자", "초란", "왕란", "계랑" \
         , "홍고추", "풋고추", "꽈리고추", "청양고추", "청고추", "오이고추", "오이 고추", "건고추", "고추가루", "고줏가루", "고춧가라" \
         , "고춧", "고춧가루", "고추" \
         , "당근", "대파", "쪽파", "파", "깐마늘", "마늘", "다진마들", "무", "양배추", "얼갈이배추", "얼갈이 배추", "배추", "양파" \ # 이미지
         , "찹쌀", "쌀", "현미", "밥", "콩", "팥", "녹두", "고구마", "시금치", "상추", "수박", "참외", "오이피클", "오이김치", "오이" \
         , "애호박", "주키니", "쥬키니", "호박", "방울토마토", "토마토", "딸기", "열무", "생강" \
         , "미나리" , "깻잎", "청피망", "피망", "파프리카", "멜론", "참깨", "께" , "땅콩" \
         , "느타리버섯", "팽이버섯", "새송이버섯", "목이버섯", "표고", "버섯" \
         , "사과", "배", "포도", "건피도", "바나나", "파인애플", "오렌지", "레몬", "망고", "아보카도" \
         , "닭", "영계", "소고기", "안심", "등심", "설도", "양지살", "살치살", "소갈비", "갈비살", "등갈비", "불고기", "불고깃", "쇠고기" \
         , "돼지앞다리", "앞다리살", "뒷다리", "삼겹살", "돼지갈비", "돼지목살", "목심", "목살", "돼지고기" \
         , "우유", "고등어", "갈치", "미역", "새우젓", "새우젖", "참치액젓", "젓갈", "멸치액젓", "솔트", "소금" \ # 물가 API
         , "스테이크", "세발나물", "멸치", "냉이나물", "냉이", "곤드레", "돈나물", "나물", "옥수수", "설탕", "치즈", "식빵", "간장" \
         , "키위", "참치캔", "파스타면", "바지락", "두부", "자몽", "도미", "부추", "게", "꽂개", "꽂개""굴", "연어캔", "연어", "버터" \
         , "바질", "대구", "오징어", "전복", "브로콜리", "브로컬리", "새우", "문어", "꼴뚜기", "오리고기", "오리", "우엉", "고수", "천일염"\ # 추가
         , "아이스크림", "견과류", "피자소스", "비엔나", "색소", "올리고당", "파아슬리" \
         , "코코아파우더",  "대추", "우스타소스", "삼계탕", "치즈 크림" \
         , "코엥트로", "당면", "겨자", "단촛물", "건강유", "식용유", "마씨" \
         , "명태포", "당", "김치", "이스트", "알", "코코넛오일", "코코넛 오일", "올리브오일", "칼" \
         , "핫케이크 가루", "팬케익", "카레가루", "커리가루", "커리", "카레", "한천", "다시마", "꽁치", "떡", "반골" \
         , "단호박밀크잼", "드레싱", "치킨양념소스", "들기름", "초콜릿", "초콜렛", "포도씨유", "포두씨유", "소주", "마구리뼈", "조청" \
         , "부대찌개양념", "시럽", "돈가스", "돈까스", "카놀라 유", "육수", "황태채", "황태", "유화제", "미초", "참치", "호두" \
         , "박력분", "달래", "마요네즈", "마들렌", "소세지", "소시지", "비스킷", "미술", "갈비양념소스", "소스", "접시", "그릇" \
         , "용기", "빨대", "틀", "꽂이", "bp", "Bp", "도넛", "도넛가루", "플래씨드", "플랙씨드", "초장", "아몬드", "어묵" \
         , "브라우니", "쯔유", "매실", "메실", "면", "새싹보리", "족발", "슈바인학센", "빵", "쿠키", "cookie" \
         , "초코케이크", "네리고마", "화자오", "쑥", "피클", "바닐라익스트림", "올리브" , "된장" \
         , "가쓰오부시", "라임", "시래기", "관자", "삼치", "초코잼", "결명자", "갓", "전분", "연근", "보리", "펜", "소라" \
         , "초코반죽", "휘핀크림", "휘핑크림", "메기", "홍차", "육개장", "치킨", "천연조미료", "msg", "MSG", "우동사리", "만두" \
         , "스팸", "햄", "초코가루", "김", "요리술", "맛술", "베이글", "시나몬", "골벵이", "흑임자", "유리병", "병", "마조람", "밤" \
         , "팩", "머스", "타드", "페퍼", "간고기", "검은깨", "오색미", "죽염", "위생봉지", "봉지", "비닐" \
         , "루꼴라", "garlic", "넛맥", "바닐라", "국거리", "사이다", "어린싹", "대창", "콜라", "도토리가루", "생선" \
         , "트레할로스", "겨우살이", "더덕", "육회", "레인보우", "밀대", "토란", "나트비아", "건타임", "차돌박이", "차돌", "빈스" \
         , "빈통조림", "완자", "장어", "식초", "블루베리쨈", "디포리", "양념", "중력분", "박력 분", "밀가루", "민찌", "녹차", "꼬막" \
         , "요거트", "아카시아", "귤", "망둥어", "초코크림", "진미채", "통깨", "수삼", "랍스터", "랍스타", "복숭아", "우둔살" \
         , "크랜베리", "베리", "꿀", "뽕잎", "깨", "야관문", "안창살", "향신즙", "말랑카우", "빼빼로", "블루베리", "비비빅", "다이제" \
         , "죽순", "견과", "커피", "컬리플라워", "참기름", "오뎅", "순대", "가리비", "과일즙", "복분자 잼", "미림", "젤라틴", "큐민" \
         , "밀", "아구", "아귀", "오레오오즈", "오레오", "샤브샤브용 고기", "샤브", "발사믹", "토토리묵", "백년초 가루", "송이" \
         , "오가피", "곱창", "두릅", "흰앙금", "동태포", "동죽", "둥죽", "가지", "북어", "사골", "해쉬브라운", "소위", "명란젓" \
         , "허브", "슈가", "요구르트", "야구르트", "비타민", "청양 마요", "와사비", "그래놀라", "회", "감", "유채", "메로", "오향분" \
         , "생크림", "북어채", "바베큐시즈닝", "야채", "맛순", "갈비", "머위", "고사리", "고기", "유과", "올갱이", "맛소근", "곶감" \
         , "녹말가루", "카라멜잼", "체리필링", "깍지", "한라봉", "덴다시", "후르츠", "어니언가루", "동부묵", "콜릿칩" \
         , "크림", "종이컵", "유자", "체리", "페스트", "노가리", "앙금", "도루묵", "비티가루", "명태", "정구지", "죠리퐁" \
         , "초코", "인삼", "코코넛", "노각", "쯔란", "볼", "화이트", "자차이", "피스타치오", "넛츠", "청경채", "캐찹", "케찹" \
         , "천연", "히카마", "짭잘이", "곤약", "식추", "수제비", "라이스", "도우", "얼갈이", "코코아", "잡곡", "낙지", "짜장" \
         , "비빔장", "일반미", "샐러드", "스프링클", "생태", "전지", "레드와인", "너구리", "과자", "척아이롤", "분말" \
         , "오미자", "치아바타", "우동", "한우", "맛살", "놀래미", "아나고", "조개", "조갯", "커스터드", "염통", "얼그레이" \
         , "우스터", "머핀", "잣", "후추", "후주", "비프", "홍합", "글", "숙주", "묵은지", "계량", "짬뽕", "잡채", "다크", "갈릭" \
         , "이리", "포토씨유", "스프", "이소말트", "와인", "율금", "피자", "짜사이", "넛트", "마이쭈", "한약", "하인즈렐리쉬" \
         , "레드향", "페페로치노", "오레가노", "카다몬", "팬네", "청주", "모과", "옹심이", "위스키", "민어", "황도", "또띠야" \
         , "도라지", "소븜", "올리부", "채소", "미니족", "하이링구", "누룽지", "병어", "피쉬", "로즈아롬", "자주", "프로슈토" \
         , "맥주", "골뱅아", "쵸콜릿", "분유", "선식", "도너츠", "후실리", "청양", "까나리", "소목뼈", "핫케이크", "레드 향" \
         , "올리뷰유", "과실청", "기름", "누텔라", "후지살", "가쓰오", "로드유", "솔잎", "홀스래디쉬", "래디시", "베이컨", "유부" \
         , "박대", "정어리", "핫도그", "육두가루", "생그림", "꼬지", "오디", "캡사이신", "마라탕", "동태", "산수유", "인절미", "딜" \
         , "청양", "쭈꾸미", "컵", "우렁이", "캐롭가루", "명란", "과일", "유리", "마요", "캔", "빨강", "유", "고기 물", "곰탕" \
         , "국물", "생수", "요리수", "물"]

temp_list = [[] for _ in range(len(ingri))]  # temp_list 초기화

for i, name in df.iterrows():
    for j, na in enumerate(ingri):
        if na in name["ING_NAME"]:
            temp_list[j].append(name["ING_NAME"])
            print(len(temp_list[j]))
            # print(temp_list[j])
            break

# 각 ingri csv로 저장
for j, na in enumerate(ingri):
    item = {f"{na}": temp_list[j]}
    new = pd.DataFrame(item)
    print('new : \n',new)
    new.to_csv(f"csv_file/item_list/item_list_{na}.csv", encoding="cp949")
    # # df 데이터프레임에서 na가 포함된 행 제거
    # df = df[~df['ING_NAME'].str.contains(f"{na}")]
    # # reindexing
    # df.reset_index(drop=True, inplace=True)
    # df.to_csv("C:/Users/anyware/Documents/카카오톡 받은 파일/RECIPE_ING_NAME_LIST2.csv", encoding="cp949")
